In [1]:
import pandas as pd
import numpy as np

In [2]:
path = './LTR_results/LTR_k5_'

In [3]:
d = pd.DataFrame()
for i in range(5):
    d_ = pd.read_csv(f"{path}{i}.txt",sep=' ',header=None)
    d_.drop(columns=[3],inplace=True)
    d = pd.concat([d,d_])

In [4]:
d.head()

   0   1               2      4           5
0  1  Q0  table-0875-680  0.488  smarttable
1  1  Q0  table-0037-411  0.592  smarttable
2  1  Q0  table-0216-976  0.139  smarttable
3  1  Q0  table-0389-400  0.471  smarttable
4  1  Q0  table-0552-511  0.580  smarttable

In [5]:
d_sorted = d.sort_values(by=[0,4], ascending=[True,False])

In [6]:
d_s_f = pd.DataFrame()
for i in range(1,61):
    d_s_f = pd.concat([d_s_f, d_sorted[d_sorted[0] == i].iloc[:20]])

In [7]:
l = []
for i in range(60):
    for j in range(1,21):
        l.append(j)
d_s_f[3] = l

In [8]:
d_s_f = d_s_f[list(range(6))]
d_s_f.head()

   0   1               2  3      4           5
3  1  Q0  table-0370-614  1  0.885  smarttable
0  1  Q0  table-1020-619  2  0.724  smarttable
1  1  Q0  table-0037-411  3  0.592  smarttable
0  1  Q0  table-0255-236  4  0.583  smarttable
4  1  Q0  table-0552-511  5  0.580  smarttable

In [9]:
d_s_f.to_csv(f'{path}total.txt', sep=' ', index=False, header=False)

In [14]:
! ../trec_eval/trec_eval -m ndcg_cut.5,10,15,20 ./LTR_results/qrels.txt ./LTR_results/LTR_k5_total.txt

ndcg_cut_5            	all	0.6532
ndcg_cut_10           	all	0.6701
ndcg_cut_15           	all	0.6990
ndcg_cut_20           	all	0.7214